aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_usbfs_dev_drv_io.c
/*******************************************************************************
* Function Name: ReadOutEndpointCpu
****************************************************************************//**
*
* Implements \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint for
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU mode.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param buffer
* Pointer to the buffer that stores data that was read.
*
* \param size
* The number of bytes to read from endpoint.
* This value must be less than or equal to endpoint maximum packet size.
*
* \param actSize
* The number of bytes that were actually read.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t ReadOutEndpointCpu(USBFS_Type *base,
                                                uint32_t   endpoint,
                                                uint8_t    *buffer,
                                                uint32_t   size,
                                                uint32_t   *actSize,
                                                cy_stc_usbfs_dev_drv_context_t *context)
{
    uint32_t idx;
    uint32_t numToCopy;

    /* Suppress a compiler warning about unused variables */
    (void) context;

    /* Get number of received bytes */
    numToCopy = Cy_USBFS_Dev_Drv_GetSieEpCount(base, endpoint);

    /* Initialize actual number of copied bytes */
    *actSize = 0U;

    /* Endpoint received more bytes than provided buffer */
    if (numToCopy > size)
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    /* Nothing to copy (zero length packet) return success */
    if (0U == numToCopy)
    {
        return CY_USBFS_DEV_DRV_SUCCESS;
    }

    /* Update number of copied bytes */
    *actSize = numToCopy;

    if (context->useReg16)
    {
        /* Get pointer to the buffer */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Cast buffer parameter is safe. User must use special macro to xallocate buffer, which handles alignment issues.');
        uint16_t *ptr = (uint16_t *) buffer;

        /* Get number of reads from 16-bit register */
        numToCopy = GET_SIZE16(numToCopy);

        /* Copy data from the hardware buffer into user buffer */
        for (idx = 0U; idx < numToCopy; ++idx)
        {
            ptr[idx] = Cy_USBFS_Dev_Drv_ReadData16(base, endpoint);
        }
    }
    else
    {
        /* Copy data from the hardware buffer into the user buffer */
        for (idx = 0U; idx < numToCopy; ++idx)
        {
            buffer[idx] = Cy_USBFS_Dev_Drv_ReadData(base, endpoint);
        }
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_Abort
****************************************************************************//**
*
* Abort operation for data endpoint.
* If there is any bus activity after the abort operation requested, the function
* waits for its completion or a timeout. A timeout is the time to transfer the
* bulk or an interrupt packet of the maximum playload size. If this bus activity is
* a transfer to the aborting endpoint, the received data is lost and the endpoint
* transfer completion callbacks are not invoked.
* After the function returns a new read or write, the endpoint operation can be submitted.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Data endpoint state \ref cy_en_usb_dev_ep_state_t after abort was applied.
*
* \note
* - This abort operation is not supported for the ISOC endpoints because
*   these endpoints do not have a handshake and are always accessible to the
*   USB Host. Therefore, an abort can cause unexpected behavior.
* - The function uses the critical section to protect from the endpoint transfer
*   complete interrupt.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_Abort(USBFS_Type *base,
                                                    uint32_t   endpoint,
                                                    cy_stc_usbfs_dev_drv_context_t *context)
{
    cy_en_usbfs_dev_drv_status_t retStatus = CY_USBFS_DEV_DRV_BAD_PARAM;
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData;
    bool flushBuffer = true;
    uint32_t intrState;

    /* Checks if the endpoint is supported by the driver */
    if (false == IS_EP_VALID(endpoint))
    {
        return retStatus;
    }

    endpoint = EP2PHY(endpoint);
    endpointData = &context->epPool[endpoint];

    /* Locks from the context modification by the endpoint completion interrupt */
    intrState = Cy_SysLib_EnterCriticalSection();

    /* Checks whether the endpoint is configured */
    if (CY_USB_DEV_EP_DISABLED == endpointData->state)
    {
        return retStatus;
    }
    else if (CY_USB_DEV_EP_STALLED == endpointData->state)
    {
        /* Aborts a pending transfer if the endpoint is stalled */
        context->epAbortMask |= (uint8_t) EP2MASK(endpoint);
        endpointData->isPending = false;
    }
    else if (CY_USB_DEV_EP_PENDING == endpointData->state)
    {
        bool isocEp = false;

        /* Sets an abort mask to discard the completion events */
        context->epAbortMask |= (uint8_t) EP2MASK(endpoint);
        endpointData->state   = CY_USB_DEV_EP_IDLE;

        /* Clears the bus busy activity */
        (void) Cy_USBFS_Dev_Drv_CheckActivity(base);

