aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/cypress/psoc64/libs/mtb-pdl-cat1/drivers/source/cy_usbfs_dev_drv_io.c
        if (endpointData->sieMode == CY_USBFS_DEV_DRV_EP_CR_ACK_IN)
        {
            Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, CY_USBFS_DEV_DRV_EP_CR_NAK_IN);
        }
        else if (endpointData->sieMode == CY_USBFS_DEV_DRV_EP_CR_ACK_OUT)
        {
            Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, CY_USBFS_DEV_DRV_EP_CR_NAK_OUT);
        }
        else
        {
            /* Does not wait for the ISOC endpoint */
            isocEp = true;
        }

        if (false == isocEp)
        {
            /* If there is a bus activity, it could be a transfer to the aborted endpoint */
            if (Cy_USBFS_Dev_Drv_CheckActivity(base))
            {
                /* Releases the lock */
                Cy_SysLib_ExitCriticalSection(intrState);

                uint32_t timeout = WAIT_TRANSFER_COMPLETE;

                /* Waits for BULK or INTERRUPT transfer completion or a NACK interrupt */
                while ( (timeout != 0U) &&
                        (0U != (context->epAbortMask & EP2MASK(endpoint))) )
                {
                    if (false == Cy_USBFS_Dev_Drv_CheckActivity(base))
                    {
                        break;
                    }

                    Cy_SysLib_DelayUs(1U);
                    --timeout;
                }
            }
        }

        /* The abort mask is cleared in the endpoint completion interrupt OR
        *  on a following call of the endpoint Remove, LoadIn or EnableOut function.
        */
    }
    else
    {
        /* Does nothing for all other states: CY_USB_DEV_EP_IDLE or CY_USB_DEV_EP_COMPLETED */
        flushBuffer = false;
        retStatus = CY_USBFS_DEV_DRV_SUCCESS;
    }

    /* Releases the lock */
    Cy_SysLib_ExitCriticalSection(intrState);

    if (flushBuffer)
    {
        bool inDirection = IS_EP_DIR_IN(endpointData->address);

        /* Initializes the pointers to functions that work with the data endpoint */
        switch(context->mode)
        {
            case CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU:
            case CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA:
            {
                /* IN endpoint: Flushes the buffer to discard the loaded data.
                *  OUT endpoint: Leaves the written data in the buffer.
                */
                if (inDirection)
                {
                    Cy_USBFS_Dev_Drv_FlushInBuffer(base, endpoint);
                }

                retStatus = CY_USBFS_DEV_DRV_SUCCESS;
            }
            break;

            case CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO:
            {
                /* IN endpoint: Flushes the buffer to discard the loaded data.
                *  OUT endpoint: Waits for DMA to complete if a transfer has been started.
                */
                retStatus = DynamicEndpointReConfiguration(base, inDirection, endpoint);
            }
            break;

            default:
                /* Unknown mode */
                break;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_StallEndpoint
****************************************************************************//**
*
* Configures data endpoint to STALL any request intended for it.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_StallEndpoint(USBFS_Type *base,
                                                            uint32_t    endpoint,
                                                            cy_stc_usbfs_dev_drv_context_t *context)
{
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData;

    /* Check if endpoint is supported by driver */
    if (false == IS_EP_VALID(endpoint))
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    endpoint = EP2PHY(endpoint);
    endpointData = &context->epPool[endpoint];

    /* Check whether endpoint is configured */
    if (CY_USB_DEV_EP_DISABLED == endpointData->state)
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    /* Store current endpoint state to restore it after Stall clear */
    endpointData->isPending = (CY_USB_DEV_EP_PENDING == endpointData->state);

    /* Stall endpoint */
    Cy_USBFS_Dev_Drv_SetSieEpStall(base, IS_EP_DIR_IN(endpointData->address), endpoint);
    endpointData->state = CY_USB_DEV_EP_STALLED;

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_UnStallEndpoint
****************************************************************************//**
*
* Release data endpoint STALL condition and clears data toggle bit.
* The endpoint is returned to the same state as it was before STALL request.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_UnStallEndpoint(USBFS_Type *base,
                                                              uint32_t    endpoint,
                                                              cy_stc_usbfs_dev_drv_context_t *context)
{
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData;

    /* Check whether the endpoint is supported by the driver */
    if (false == IS_EP_VALID(endpoint))
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    endpoint = EP2PHY(endpoint);
    endpointData = &context->epPool[endpoint];

    /* Check whether the endpoint is configured */
    if (CY_USB_DEV_EP_DISABLED == endpointData->state)
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    /* Clear toggle bit */
    endpointData->toggle = 0U;

    if (endpointData->isPending)
    {
        /* Restore pending state */
        endpointData->state = CY_USB_DEV_EP_PENDING;

        /* Clear toggle and enable endpoint to respond to host */
        Cy_USBFS_Dev_Drv_ClearSieEpToggle(base, endpoint);
        Cy_USBFS_Dev_Drv_ClearSieEpStall (base, endpoint, (uint32_t) endpointData->sieMode);
    }
    else
    {
        /* Endpoint is ready for operation */
        context->epPool[endpoint].state = CY_USB_DEV_EP_IDLE;

        /* Set endpoint inactive mode */
        Cy_USBFS_Dev_Drv_ClearSieEpToggle(base, endpoint);
        Cy_USBFS_Dev_Drv_ClearSieEpStall (base, endpoint, GetEndpointInactiveMode((uint32_t) endpointData->sieMode));
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXUSBFS */


/* [] END OF FILE */
